oracoll/ESP32RET/ESP32RET CLEAN/lib/ESP32_MCP2517FD/src/esp32_mcp2517fd.cpp
#include "Arduino.h"
#include <SPI.h>
#include "esp32_mcp2517fd.h"
#include "esp32_mcp2517fd_defines.h"
#include "esp32_mcp2517fd_regs.h"

extern SemaphoreHandle_t sdMutex;


#if SOC_TWAI_CONTROLLER_NUM == 2 and ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 2, 0)
//CS, INT
MCP2517FD __attribute__((weak)) CAN2(5, 27) ;
#else
MCP2517FD __attribute__((weak)) CAN1(5, 27) ;
#endif

//20Mhz is the fastest we can go (because of the MCP2517/18 chip. The ESP32 or ESP32S3 can go much faster)
#define FD_SPI_SPEED 10000000

SPISettings fdSPISettings(FD_SPI_SPEED, MSBFIRST, SPI_MODE0);

//Modified to loop, waiting for 1ms then pretending an interrupt came in
//basically switches to a polled system where we do not pay attention to actual interrupts
void task_MCPIntFD( void *pvParameters )
{
    const TickType_t iDelay = portTICK_PERIOD_MS;
    MCP2517FD* mcpCan = (MCP2517FD*)pvParameters;
    while (1)
    {
        vTaskDelay(iDelay);
        mcpCan->intHandler(); //not truly an interrupt handler anymore
    }
}

//checks ever 2 seconds to see if a CAN error happened. Will reset the CAN hardware if so.
void task_ResetWatcher(void *pvParameters)
{
    MCP2517FD* mcpCan = (MCP2517FD*)pvParameters;
    const TickType_t xDelay = 2000 / portTICK_PERIOD_MS;
    uint32_t ctrlVal;

    for(;;)
    {
        vTaskDelay( xDelay );

        //read CiCon then see if operation mode is b111/7 which is restricted mode. If so we reset
        ctrlVal = mcpCan->Read(ADDR_CiCON);
        ctrlVal = (ctrlVal >> 21) & 7;
        if (ctrlVal == 7)
        {
            mcpCan->needMCPReset = true;
            if (mcpCan->debuggingMode) Serial.println("!!!RESTRICTED MODE!!!");
        }

        if (mcpCan->needMCPReset)
        {
            mcpCan->needMCPReset = false;
            if (mcpCan->debuggingMode) Serial.println("Reset 2517FD hardware");
            mcpCan->resetHardware();
        }
        if (mcpCan->needTXFIFOReset)
        {
            mcpCan->needTXFIFOReset = false;
            if (mcpCan->debuggingMode) Serial.println("Reset TX FIFO");
            mcpCan->txQueueSetup();
        }
    }
}

//Reset the hardware to its last configured state
//Also prints out the diag registers if you have debugging text enabled.
//Saves then restores all filtering as well.
void MCP2517FD::resetHardware()
{
    if (sdMutex != NULL) {
        xSemaphoreTakeRecursive(sdMutex, portMAX_DELAY);
    }
    uint32_t filters[32];
    uint32_t masks[32];
    uint32_t ctrl[8]; //each ctrl reg has four filters so only 8 regs not 32
    int idx;
    if (debuggingMode)
    {
        printf("Diag0: %x\n     Diag1: %x     ErrFlgs: %x", getCIBDIAG0(), cachedDiag1, getErrorFlags());
    }
    cachedDiag1 = 0;

    for (idx = 0; idx < 32; idx++)
    {
        filters[idx] = Read(ADDR_CiFLTOBJ + (CiFILTER_OFFSET * idx));
        masks[idx] = Read(ADDR_CiMASK + (CiFILTER_OFFSET * idx));
    }
    for (idx = 0; idx < 8; idx++) ctrl[idx] = Read(ADDR_CiFLTCON + 4 * idx);

    if (inFDMode) initFD(savedNominalBaud, savedDataBaud);
    else init(savedNominalBaud);

    for (idx = 0; idx < 32; idx++)
    {
        Write(ADDR_CiFLTOBJ + (CiFILTER_OFFSET * idx), filters[idx]);
        Write(ADDR_CiMASK + (CiFILTER_OFFSET * idx), masks[idx]);
    }
    for (idx = 0; idx < 8; idx++) Write(ADDR_CiFLTCON + 4 * idx, ctrl[idx]);
    if (sdMutex != NULL) {
        xSemaphoreGiveRecursive(sdMutex);
    }
}

/*
Issue callbacks to registered functions and objects
Used to keep this kind of thing out of the interrupt handler
The callback type and mailbox are passed in the fid member of the
CAN_FRAME struct. It isn't really used by anything.
Layout of the storage:
bit   31 -    If set indicates an object callback
bits  24-30 - Idx into listener table
bits  0-7   - Mailbox number that triggered callback
*/
void task_MCPCAN( void *pvParameters )
{
    MCP2517FD* mcpCan = (MCP2517FD*)pvParameters;
    CAN_FRAME_FD rxFrameFD;
    CAN_FRAME rxFrame;

    while (1)
    {
        //receive next CAN frame from queue and fire off the callback
        if (mcpCan->callbackQueueMCP)
        {
            if (!mcpCan->inFDMode)
            {
                if(xQueueReceive(mcpCan->callbackQueueMCP, &rxFrame, portMAX_DELAY)==pdTRUE)
                {
                    mcpCan->canToFD(rxFrame, rxFrameFD);
                    mcpCan->sendCallback(&rxFrameFD);
                }
            }
            else
            {
                if(xQueueReceive(mcpCan->callbackQueueMCP, &rxFrameFD, portMAX_DELAY)==pdTRUE)
                {
                    mcpCan->sendCallback(&rxFrameFD);
                }
            }
        }
    }
}

void MCP2517FD::sendCallback(CAN_FRAME_FD *frame)
{
    //frame buffer
    CANListener *thisListener;
    int mb;
    int idx;
    CAN_FRAME stdFrame;
    bool isFD = false;

    if (!fdToCan(*frame, stdFrame)) isFD = true;

    mb = (frame->fid & 0xFF);
    if (mb == 0xFF) mb = -1;

    if (frame->fid & 0x80000000ul) //object callback
    {
        idx = (frame->fid >> 24) & 0x7F;
        thisListener = listener[idx];
        if (isFD) thisListener->gotFrameFD(frame, mb);
        else thisListener->gotFrame(&stdFrame, mb);
    }
    else //C function callback
    {
        if (isFD)
        {
          if (mb > -1) (*cbCANFrameFD[mb])(frame);
          else (*cbGeneralFD)(frame);
        }
        else
        {
          if (mb > -1) (*cbCANFrame[mb])(&stdFrame);
          else (*cbGeneral)(&stdFrame);
        }
    }
}

MCP2517FD::MCP2517FD(uint8_t CS_Pin, uint8_t INT_Pin) : CAN_COMMON(32) {
    _CS = CS_Pin;
    _INT = INT_Pin;

    savedNominalBaud = 0;
    savedDataBaud = 0;
    savedFreq = 0;
    running = 0;
    inFDMode = false;
    fdSupported = true;
    txBufferSize = FD_TX_BUFFER_SIZE;
    rxBufferSize = FD_RX_BUFFER_SIZE;
    initializedResources = false;
}

void MCP2517FD::setRXBufferSize(int newSize)
{
    rxBufferSize = newSize;
}

void MCP2517FD::setTXBufferSize(int newSize)
{
    txBufferSize = newSize;
}


void MCP2517FD::initializeResources()
{
    if (initializedResources) return;

    if (debuggingMode) Serial.println("initializeResources()");

    pinMode(_CS, OUTPUT);
    digitalWrite(_CS,HIGH);
    pinMode(_INT,INPUT);
    //digitalWrite(_INT,HIGH);

    //attachInterrupt(_INT, MCPFD_INTHandler, FALLING);
    if (debuggingMode) Serial.println("Initialized hardware pins");

    //queues allocate the requested space plus 96 bytes overhead
    if (inFDMode)
    {
        rxQueue = xQueueCreate(rxBufferSize, sizeof(CAN_FRAME_FD));
        txQueue = xQueueCreate(txBufferSize, sizeof(CAN_FRAME_FD));
        //as in the ESP32-Builtin CAN we create a queue and task to do callbacks outside the interrupt handler
        callbackQueueMCP = xQueueCreate(16, sizeof(CAN_FRAME_FD));
    }
    else
    {
        rxQueue = xQueueCreate(rxBufferSize, sizeof(CAN_FRAME));
        txQueue = xQueueCreate(txBufferSize, sizeof(CAN_FRAME));
        //as in the ESP32-Builtin CAN we create a queue and task to do callbacks outside the interrupt handler
        callbackQueueMCP = xQueueCreate(16, sizeof(CAN_FRAME));
    }
    if (debuggingMode) Serial.println("Initialized queues");

