oracoll/ESP32RET/ESP32RET CLEAN/lib/ESP32_MCP2517FD/src/esp32_mcp2517fd.cpp
                           //func        desc    stack, params, priority, handle to task, which core to pin to
    //Tasks take up the stack you allocate here in bytes plus 388 bytes overhead
#if defined(CONFIG_FREERTOS_UNICORE)
    xTaskCreate(&task_MCPCAN, "CAN_FD_CALLBACK", 6144, this, 8, &taskHandleMCPCAN);
    xTaskCreate(&task_MCPIntFD, "CAN_FD_INT", 4096, this, 19, &intTaskFD);
    xTaskCreate(&task_ResetWatcher, "CAN_RSTWATCH", 4096, this, 7, &taskHandleReset);
#else
    xTaskCreatePinnedToCore(&task_MCPCAN, "CAN_FD_CALLBACK", 6144, this, 8, &taskHandleMCPCAN, 0);
    xTaskCreatePinnedToCore(&task_MCPIntFD, "CAN_FD_INT", 4096, this, 19, &intTaskFD, 0);
    xTaskCreatePinnedToCore(&task_ResetWatcher, "CAN_RSTWATCH", 4096, this, 7, &taskHandleReset, 0);
#endif
    if (debuggingMode) Serial.println("Done with resource init");

    initializedResources = true;
}

void MCP2517FD::setINTPin(uint8_t pin)
{
    //detachInterrupt(_INT);
    _INT = pin;
    //pinMode(_INT,INPUT);
    //digitalWrite(_INT,HIGH);
    //attachInterrupt(_INT, MCPFD_INTHandler, FALLING);
}

void MCP2517FD::setCSPin(uint8_t pin)
{
    _CS = pin;
    pinMode(_CS, OUTPUT);
    digitalWrite(_CS,HIGH);
}

//Some sort of horrific closed head injury caused the designers of the MCP2517FD to store
//29 bit extended frames with the 18 extended bits first then the 11 standard bits added higher up
//instead of just plain making the 29 bit ID or mask contiguous in the 32 bit register. So, two routines
//here to massage the data bits around to match

//Take a 29 bit ID or MASK and turn it into a packed format suitable for the hardware register
uint32_t MCP2517FD::packExtValue(uint32_t input)
{
    return ( ((input >> 18) & 0x7FF) + ((input & 0x3FFFF) << 11) );
}

//Reverse that process for when we receive IDs in the stupid format and want the real ID
uint32_t MCP2517FD::unpackExtValue(uint32_t input)
{
    return ( ((input >> 11) & 0x3FFFF) + ((input & 0x7FF) << 18));
}

void MCP2517FD::initSPI()
{
    // Set up SPI Communication
    // dataMode can be SPI_MODE0 or SPI_MODE3 only for MCP2517FD
    SPI.begin(SCK, MISO, MOSI, SS);
    SPI.setClockDivider(spiFrequencyToClockDiv(FD_SPI_SPEED));
    SPI.setDataMode(SPI_MODE0);
    SPI.setBitOrder(MSBFIRST);
    SPI.setHwCs(false); //allow manual control of CS line
    if (debuggingMode) Serial.println("MCP2517FD SPI Inited");
}

/*
  Initialize MCP2517FD

  int CAN_Bus_Speed = transfer speed in kbps (or raw CAN speed in bits per second)
  int Freq = MCP2517FD oscillator frequency in MHz
  int SJW = Synchronization Jump Width Length bits - 1 to 4 (see data sheet)

  returns baud rate set

  Sending a bus speed of 0 kbps initiates AutoBaud and returns zero if no
  baud rate could be determined.  There must be two other active nodes on the bus!
*/
int MCP2517FD::Init(uint32_t CAN_Bus_Speed, uint8_t Freq) {
    return Init(CAN_Bus_Speed, Freq, 3);
}

int MCP2517FD::Init(uint32_t CAN_Bus_Speed, uint8_t Freq, uint8_t SJW) {
    if(SJW < 1) SJW = 1;
    if(SJW > 4) SJW = 4;
    REG_CiINT interruptFlags;

    if (debuggingMode) Serial.println("Initializing MCP2517FD");

    initSPI();

    int i = 0;
    if(CAN_Bus_Speed > 0)
    {
        if(_init(CAN_Bus_Speed, Freq, SJW, false))
        {
            savedNominalBaud = CAN_Bus_Speed;
            savedFreq = Freq;
            running = 1;
            errorFlags = 0;
            rxFault = false;
            txFault = false;
            faulted = false;
	        return CAN_Bus_Speed;
        }
    }
    else
    {
	    for(i = 20; i < 1000; i = i + 5)
        {
	        if(_init(i, Freq, 1, true))
            {
                // check for bus activity
		        Write16(ADDR_CiINT,0); //write to INT flags to unset flags we can clear
		        delay(500); // need the bus to be communicating within this time frame
		        if(Interrupt())
                {
		            // determine which interrupt flags have been set
		            interruptFlags.word = Read(ADDR_CiINT);
		            if(!interruptFlags.bF.IF.CERRIF)
                    {
		                // to get here we must have received something without errors
		                Mode(CAN_NORMAL_MODE);
			            savedNominalBaud = i;
			            savedFreq = Freq;
			            running = 1;
                        errorFlags = 0;
                        rxFault = false;
                        txFault = false;
                        faulted = false;
			            return i;
		            }
		        }
	        }
	    }
    }
    return 0;
}

uint32_t MCP2517FD::initFD(uint32_t nominalRate, uint32_t dataRate)
{
    REG_CiINT interruptFlags;
    int i = 0;

    initSPI();

    if(nominalRate > 0)
    {
        if(_initFD(nominalRate, dataRate, 40, 4, false))
        {
            savedNominalBaud = nominalRate;
            savedDataBaud = dataRate;
            savedFreq = 40;
            running = 1;
            errorFlags = 0;
            rxFault = false;
            txFault = false;
            faulted = false;
	        return nominalRate;
        }
    }
    else
    {
	    for(i = 20; i < 1000; i = i + 5)
        {
	        if(_initFD(i, dataRate, 40, 4, true))
            {
                // check for bus activity
		        Write16(ADDR_CiINTENABLE,0); //write to INT flags to unset flags we can clear
		        delay(500); // need the bus to be communicating within this time frame
		        if(Interrupt())
                {
		            // determine which interrupt flags have been set
		            interruptFlags.word = Read(ADDR_CiINT);
		            if(!interruptFlags.bF.IF.CERRIF)
                    {
		                // to get here we must have received something without errors
		                Mode(CAN_NORMAL_MODE);
			            savedNominalBaud = i;
                        savedDataBaud = dataRate;
			            savedFreq = 40;
			            running = 1;
                        errorFlags = 0;
                        rxFault = false;
                        txFault = false;
                        faulted = false;
			            return i;
		            }
		        }
	        }
	    }
    }
    return 0;
}


void MCP2517FD::txQueueSetup()
{
    uint32_t debugVal;
    REG_CiTXQCON txQCon;
    const TickType_t xDelay = 1;

    Write8(ADDR_CiFIFOCON + 1, 0); //Unset TXREQ which should abort all pending TX frames in queue
    vTaskDelay(xDelay); //wait a bit for that to work

    txQCon.word = 0x400; //set FRESET to reset this FIFO
    Write(ADDR_CiTXQCON, txQCon.word);
    vTaskDelay(xDelay);

    //transmit queue set up
    txQCon.word = 0;
    txQCon.txBF.PayLoadSize = 7; //64 bytes
    txQCon.txBF.FifoSize = 8; //9 frame long FIFO
    txQCon.txBF.TxAttempts = 0; //No retries. One and done. It works or we throw it away
    txQCon.txBF.TxPriority = 15; //middle priority
    txQCon.txBF.TxEmptyIE = 0;
    Write(ADDR_CiTXQCON, txQCon.word);
    if (debuggingMode)
    {
        debugVal = Read(ADDR_CiTXQCON);
        Serial.println(debugVal, BIN);
    }
}

//chunks of the hardware init that are in common between standard and FD mode
//Setup timer hardware, FIFOs, and Transmit Queue
void MCP2517FD::commonInit()
{
    uint32_t debugVal;
    if (debuggingMode) Serial.println("commonInit()");

