oracoll/ESP32RET/ESP32RET CLEAN/lib/ESP32_MCP2517FD/src/esp32_mcp2517fd.cpp
    REG_CiFIFOCON fifoCon;
    REG_CiTSCON tsCon;

    txQueueSetup();

    //builtin timerstamping setup
    tsCon.bF.TBCPrescaler = 39; //40x slow down means 1us resolution
    tsCon.bF.TBCEnable = 1;
    Write(ADDR_CiTSCON ,tsCon.word);
    if (debuggingMode)
    {
        debugVal = Read(ADDR_CiTSCON);
        Serial.println(debugVal, BIN);
    }

    //Last FIFO we'll set up is receive fifo
    fifoCon.word = 0; //clear it all out to start fresh
    fifoCon.rxBF.TxEnable = 0; //Make FIFO1 a RX FIFO
    fifoCon.rxBF.FifoSize = 17; //18 frames long
    fifoCon.rxBF.PayLoadSize = 7; //64 byte payload possible
    fifoCon.rxBF.RxFullIE = 1; //if the FIFO fills up let the code know (hopefully never happens!)
    fifoCon.rxBF.RxNotEmptyIE = 1; //if the FIFO isn't empty let the code know
    fifoCon.rxBF.RxTimeStampEnable = 1; //time stamp each frame as it comes in
    Write(ADDR_CiFIFOCON + (CiFIFO_OFFSET * 1), fifoCon.word); //Write to FIFO1
}

bool MCP2517FD::_init(uint32_t CAN_Bus_Speed, uint8_t Freq, uint8_t SJW, bool autoBaud) {
    REG_CiNBTCFG nominalCfg;
    REG_CiCON canConfig;
    int tseg1, tseg2;
    uint32_t debugVal;

    inFDMode = false;

    if (debuggingMode) Serial.println("_init()");

    Write(ADDR_CiINT,0); //disable all interrupts during init

    if (!initializedResources) initializeResources();

    // Reset MCP2517FD which puts us in config mode automatically
    Reset();
    delay(1);

    //but, just to be sure, explicitly ask for config mode
    if(!Mode(CAN_CONFIGURATION_MODE))
    {
        if (debuggingMode) Serial.println("Could not enter configuration mode");
        return false;
    }

    Write(ADDR_CiINT,0); //disable all interrupts during init
    Write(ADDR_CiBDIAG0, 0); //clear debug flags too.
    Write(ADDR_CiBDIAG1, 0);
    errorFlags = 0;
    cachedDiag1 = 0;

    /*the MCP2517 has a very wide range for setting the baud rate. The sys clock is 40Mhz by default.
    But, someone can pass a different value if using a different crystal.
    We'll target around "Freq" TQ (with a target 75% sample point) for each bit on the CAN
    so we want a prescaler that takes 1 million / target baud to get a prescaler.
    Obviously this makes the upper limit 1M CAN rate be a prescaler of 1.
    250K is a prescaler of 4, 33.333k is a prescale of 30
    We need TSEG1 + TSEG2 + 1 to equal Freq
    */
    // Set registers
    nominalCfg.bF.SJW = SJW;
    tseg1 = (unsigned int)(((float)Freq / 4.0) * 3.0) - 1;
    tseg2 = Freq - tseg1 - 1;
    nominalCfg.bF.TSEG1 = tseg1 - 1; //registers store value one less than actual
    nominalCfg.bF.TSEG2 = tseg2 - 1;
    if (tseg1 > 256 || tseg1 < 1)
    {
        if (debuggingMode) Serial.println("Nominal TSeg1 outside of limits. Invalid baud rate!");
        return false;
    }
    if (tseg2 > 128 || tseg2 < 1)
    {
        if (debuggingMode) Serial.println("Nominal TSeg2 outside of limits. Invalid baud rate!");
        return false;
    }
    nominalCfg.bF.BRP = (1000000ul / CAN_Bus_Speed) - 1;
    uint32_t calcRate = (Freq * 1000000ul) / (nominalCfg.bF.BRP + 1) / (tseg1 + tseg2 + 1);
    int errRate = abs(int(CAN_Bus_Speed - calcRate));
    if (errRate >= (CAN_Bus_Speed / 50)) //if more than 2% error in speed setting
    {
        if (debuggingMode)
        {
            Serial.println("WARNING - Set baud does not match requested baud.");
            Serial.println(calcRate);
        }
    }

    canConfig.bF.IsoCrcEnable = 0; //Don't use newer ISO format. I think it might screw up normal can? Maybe this doesn't matter at all for std can
    canConfig.bF.DNetFilterCount = 0; //Don't use device net filtering
    canConfig.bF.ProtocolExceptionEventDisable = 0; //Allow softer handling of protocol exception
    canConfig.bF.WakeUpFilterEnable = 0; //Not using wakeup filter
    canConfig.bF.BitRateSwitchDisable = 1; //We won't allow FD rate switching in this standard init function
    canConfig.bF.RestrictReTxAttempts = 1; //Don't try sending frames forever if no one acks them
    canConfig.bF.EsiInGatewayMode = 0; //ESI reflects error status
    canConfig.bF.SystemErrorToListenOnly = 0; //Don't automatically switch to listen only on system error
    canConfig.bF.StoreInTEF = 0; // Don't store transmitted messages back into RAM
    canConfig.bF.TXQEnable = 1; //But, do enable the transmission queue and save space for it in RAM
    canConfig.bF.TxBandWidthSharing = 4; //wait 16 bit times before trying to send another frame. Allows other nodes a bit of room to butt in
    canConfig.bF.RequestOpMode = CAN_CONFIGURATION_MODE;
    Write(ADDR_CiCON, canConfig.word);
    Write(ADDR_CiNBTCFG, nominalCfg.word); //write the nominal bit time register
    if (debuggingMode)
    {
        debugVal = Read(ADDR_CiCON);
        printf("CiCON: %x\n", debugVal);
        debugVal = Read(ADDR_CiNBTCFG);
        printf("CiNBTCFG: %x\n", debugVal);
    }

    commonInit();

    Write(ADDR_CiINT,0); //disable all interrupts during init
    Write(ADDR_CiBDIAG0, 0); //clear debug flags too.
    Write(ADDR_CiBDIAG1, 0);
    errorFlags = 0;
    cachedDiag1 = 0;

    if(!autoBaud)
    {
        // Return to Normal mode
        if(!Mode(CAN_CLASSIC_MODE))
        {
            if (debuggingMode) Serial.println("Could not enter normal mode");
            return false;
        }
    }
    else
    {
        // Set to Listen Only mode
        if(!Mode(CAN_LISTEN_ONLY_MODE))
        {
            if (debuggingMode) Serial.println("Could not enter listen only mode");
            return false;
        }
    }

    // Enable interrupts
    Write(ADDR_CiINT, 0xB8030000); //Enable Invalid Msg, Bus err, sys err, rx overflow, rx fifo, tx fifo interrupts
    // Test that we can read back from the MCP2515 what we wrote to it
    uint32_t rtn = Read(ADDR_CiINT);
    if ((rtn & 0xFFFF0000) == 0xB8030000)
    {
        if (debuggingMode) Serial.println("MCP2517 Init Success");
        errorFlags = 0;
        cachedDiag1 = 0;
        Write(ADDR_CiBDIAG0, 0); //clear debug flags too.
        Write(ADDR_CiBDIAG1, 0);
        rxFault = false;
        txFault = false;
        faulted = false;

