oracoll/ESP32RET/ESP32RET CLEAN/lib/ESP32_MCP2517FD/src/esp32_mcp2517fd.cpp
        return true;
    }
    else
    {
        if (debuggingMode)
        {
            printf("MCP2517 Init Failed. CiINT = %x", rtn);
        }
        return false;
    }
    return false;
}

bool MCP2517FD::_initFD(uint32_t nominalSpeed, uint32_t dataSpeed, uint8_t freq, uint8_t sjw, bool autoBaud)
{
    REG_CiNBTCFG nominalCfg;
    REG_CiDBTCFG dataCfg;
    REG_CiCON canConfig;
    REG_CiTDC txDelayConfig;
    int tseg1, tseg2;

    uint32_t neededTQ;

    inFDMode = true;

    if (debuggingMode) Serial.println("_initFD()");

    if (!initializedResources) initializeResources();

    if (nominalSpeed < 125000) return 0; //won't work, die - Keep in mind that the FD spec doesn't want less than 500k here though
    if (dataSpeed < 1000000ul) return 0; //also won't work.

    // Reset MCP2517FD which puts us in config mode automatically
    Reset();
    delay(1);

    Write(ADDR_CiINT,0); //disable all interrupts during init

    /*Forget everything said about the baud rate generator in the _init function above. When we
    plan to be in FD mode it is best if the baud rate generator uses the same prescaler for both
    the nominal and data rates.
    */
    // Set registers
    nominalCfg.bF.SJW = sjw;
    neededTQ = (freq * 1000000ul) / nominalSpeed;
    tseg1 = ((neededTQ * 8) / 10) - 1; //set sample point at 80%
    tseg2 = neededTQ - tseg1 - 1;
    if (tseg1 > 256 || tseg1 < 1)
    {
        if (debuggingMode) Serial.println("Nominal TSeg1 outside of limits. Invalid baud rates!");
        return false;
    }
    if (tseg2 > 128 || tseg2 < 1)
    {
        if (debuggingMode) Serial.println("Nominal TSeg2 outside of limits. Invalid baud rates!");
        return false;
    }

    nominalCfg.bF.TSEG1 = tseg1 - 1;
    nominalCfg.bF.TSEG2 = tseg2 - 1;
    nominalCfg.bF.BRP = 0; //baud rate prescaler. 0 = 1x prescale

    if (debuggingMode) Serial.printf("Nomimal Settings:  TSEG1: %u   TSEG2: %u\n", tseg1, tseg2);

    /*As above, we lock the prescaler at 1x and figure out the Seg1/Seg2 based on that.
    */
    dataCfg.bF.SJW = sjw;
    neededTQ = (freq * 1000000ul) / dataSpeed;
    tseg1 = ((neededTQ * 8) / 10) - 1; //set sample point at 80%
    tseg2 = neededTQ - tseg1 - 1;
    if (tseg1 > 32 || tseg1 < 1)
    {
        if (debuggingMode) Serial.println("Data TSeg1 outside of limits. Invalid baud rates!");
        return false;
    }
    if (tseg2 > 16 || tseg2 < 1)
    {
        if (debuggingMode) Serial.println("Data TSeg2 outside of limits. Invalid baud rates!");
        return false;
    }

    dataCfg.bF.TSEG1 = tseg1 - 1;
    dataCfg.bF.TSEG2 = tseg2 - 1;
    dataCfg.bF.BRP = 0;

    txDelayConfig.bF.TDCMode = 2; //automatic mode. The module will figure out the proper delay itself
    txDelayConfig.bF.TDCValue = 0; //this value set by hardware in auto mode
    txDelayConfig.bF.TDCOffset = (dataCfg.bF.BRP + 1) * (tseg1); //set value (dbrp * dtseg1) as a basepoint
    nominalCfg.bF.SJW = tseg2 - 1;
    dataCfg.bF.SJW = tseg2 - 1;
    if (debuggingMode) Serial.printf("Data Settings:  TSEG1: %u   TSEG2: %u\n", tseg1, tseg2);

    canConfig.bF.IsoCrcEnable = 1; //It's likely we need ISO CRC mode active to get FD to work properly
    canConfig.bF.DNetFilterCount = 0; //Don't use device net filtering
    canConfig.bF.ProtocolExceptionEventDisable = 0; //Allow softer handling of protocol exception
    canConfig.bF.WakeUpFilterEnable = 0; //Not using wakeup filter
    canConfig.bF.BitRateSwitchDisable = 0; //Let each TX frame tell us whether to use FD rate switching or not
    canConfig.bF.RestrictReTxAttempts = 1; //Don't try sending frames forever if no one acks them
    canConfig.bF.EsiInGatewayMode = 0; //ESI reflects error status
    canConfig.bF.SystemErrorToListenOnly = 1; //Auto switch to listen only on system err bit
    canConfig.bF.StoreInTEF = 0; // Don't store transmitted messages back into RAM
    canConfig.bF.TXQEnable = 1; //But, do enable the transmission queue and save space for it in RAM
    canConfig.bF.TxBandWidthSharing = 4; //wait 16 bit times before trying to send another frame. Allows other nodes a bit of room to butt in
    canConfig.bF.RequestOpMode = CAN_CONFIGURATION_MODE;
    Write(ADDR_CiCON, canConfig.word);
    Write(ADDR_CiNBTCFG, nominalCfg.word); //write the nominal bit time register
    Write(ADDR_CiDBTCFG, dataCfg.word); //and write out the data rate register too
    Write(ADDR_CiTDC, txDelayConfig.word); //write out transmission delay compensation register.

    commonInit();

    if(!autoBaud)
    {
        // Return to Normal mode
        if(!Mode(CAN_NORMAL_MODE))
        {
            if (debuggingMode) Serial.println("Could not enter normal mode");
            return false;
        }
    }
    else
    {
        // Set to Listen Only mode
        if(!Mode(CAN_LISTEN_ONLY_MODE))
        {
            if (debuggingMode) Serial.println("Could not enter listen only mode");
            return false;
        }
    }
    // Enable interrupts
    Write(ADDR_CiINT, 0xB8030000); //Enable Invalid Msg, Bus err, sys err, rx overflow, rx fifo, tx fifo interrupts
    // Test that we can read back from the MCP2517FD what we wrote to it
    uint32_t rtn = Read(ADDR_CiINT);
    if ((rtn & 0xFFFF0000) == 0xB8030000)
    {
        if (debuggingMode) Serial.println("MCP2517 InitFD Success");
        errorFlags = 0;
        rxFault = false;
        txFault = false;
        faulted = false;
        return true;
    }
    else
    {
        if (debuggingMode)
        {
            Serial.println(rtn, HEX);
        }
        return false;
    }
    return false;
}

uint16_t MCP2517FD::available()
{
    if (!rxQueue) return 0; //why would this happen though?!
	return uxQueueMessagesWaiting(rxQueue);
}

int MCP2517FD::_setFilter(uint32_t id, uint32_t mask, bool extended)
{
    uint8_t filterCtrl;

    for (int i = 0; i < 32; i++)
    {
        filterCtrl = Read(ADDR_CiFLTCON + i);
        if ( !(filterCtrl & 0x80) )
        {
            _setFilterSpecific(i, id, mask, extended);
            return i;
        }
    }
    //if we got here then there were no free filters. Return value of deaaaaath!
    if (debuggingMode) Serial.println("Err: No filter set!");
    return -1;
}

//we've got 32 filters each with their own mask.
int MCP2517FD::_setFilterSpecific(uint8_t mailbox, uint32_t id, uint32_t mask, bool extended)
{
    uint32_t packedID, packedMask;
    if (mailbox > 31) return 0; //past end of valid mailbox #said

    //First up, make sure it's disabled as you can't set an enabled filter/mask combination
    Write8(ADDR_CiFLTCON + mailbox, 0);
    //Then we can directly write the filter and mask out - Using extended to augment bit 30 appropriately
    packedID = id;
    packedMask = mask;
    if (extended)
    {
        packedID = packExtValue(packedID);
        packedMask = packExtValue(packedMask);
    }
    else
    {
        packedID = packedID & 0x7FF;
        packedMask = packedMask & 0x7FF;
    }
    packedMask |= 1 << 30; //filter/mask combo must match extended/std exactly. Won't allow both
    if (extended) packedID |= 1 << 30; //only allow extended frames to match
    Write(ADDR_CiFLTOBJ + (CiFILTER_OFFSET * mailbox), packedID);
    Write(ADDR_CiMASK + (CiFILTER_OFFSET * mailbox), packedMask);
    Write8(ADDR_CiFLTCON + mailbox, 0x80 + 1); //Enable the filter and send it to FIFO1 which is the RX FIFO
    return mailbox;
}

uint32_t MCP2517FD::init(uint32_t ul_baudrate)
{
    return Init(ul_baudrate, 40);
}

uint32_t MCP2517FD::beginAutoSpeed()
{
    return Init(0, 40);
}

uint32_t MCP2517FD::set_baudrate(uint32_t ul_baudrate)
{
    return Init(ul_baudrate, 40);
}

uint32_t MCP2517FD::set_baudrateFD(uint32_t nominalSpeed, uint32_t dataSpeed)
{
    return _initFD(nominalSpeed, dataSpeed, 40, 4, false);
}

void MCP2517FD::setListenOnlyMode(bool state)
{
    if (state)
    {
        Mode(CAN_LISTEN_ONLY_MODE); //listen only seems to always accept FD frames
    }
    else
    {
        if (!inFDMode) Mode(CAN_CLASSIC_MODE);
        else Mode(CAN_NORMAL_MODE);
    }
}

void MCP2517FD::enable()
{
    if (!inFDMode) Mode(CAN_CLASSIC_MODE);
    else Mode(CAN_NORMAL_MODE);
}

void MCP2517FD::disable()
{
    Mode(CAN_CONFIGURATION_MODE);
}

bool MCP2517FD::sendFrame(CAN_FRAME& txFrame)
{
    EnqueueTX(txFrame);
    return true;
}

bool MCP2517FD::sendFrameFD(CAN_FRAME_FD& txFrame)
{
    EnqueueTX(txFrame);
    return true;
}

bool MCP2517FD::rx_avail()
{
    return available() > 0 ? true : false;
}

uint32_t MCP2517FD::get_rx_buff(CAN_FRAME &msg)
{
    CAN_FRAME_FD temp;
    bool ret = GetRXFrame(msg);
    //f (ret) ret = fdToCan(temp, msg);
    return ret;
}

