oracoll/ESP32RET/ESP32RET CLEAN/lib/ESP32_MCP2517FD/src/esp32_mcp2517fd.cpp
uint32_t MCP2517FD::get_rx_buffFD(CAN_FRAME_FD &msg)
{
    return GetRXFrame(msg);
}

uint32_t MCP2517FD::getErrorFlags()
{
    return errorFlags;
}

uint32_t MCP2517FD::getCIBDIAG0()
{
    return Read(ADDR_CiBDIAG0);
}

uint32_t MCP2517FD::getCIBDIAG1()
{
    return Read(ADDR_CiBDIAG1);
}

uint32_t MCP2517FD::getBitConfig()
{
    return Read(ADDR_CiNBTCFG);
}

//Prints to screen basically all of the important registers including debugging registers.
void MCP2517FD::printDebug()
{
    Serial.println();
    Serial.print("Diag0: ");
    Serial.print(getCIBDIAG0(), HEX);
    Serial.print("  Diag1: ");
    Serial.print(getCIBDIAG1(), HEX);
    Serial.print("  ErrFlags: ");
    Serial.println(errorFlags, HEX);

    Serial.print("Ctrl: ");
    Serial.print(Read(ADDR_CiCON), HEX);
    Serial.print("  NomBits: ");
    Serial.print(Read(ADDR_CiNBTCFG), HEX);
    Serial.print("  DataBits: ");
    Serial.print(Read(ADDR_CiDBTCFG), HEX);
    Serial.print("  TDC: ");
    Serial.println(Read(ADDR_CiTDC), HEX);

    Serial.print("TxqCon: ");
    Serial.print(Read(ADDR_CiTXQCON), HEX);
    Serial.print("  TsCon: ");
    Serial.print(Read(ADDR_CiTSCON), HEX);
    Serial.print("  Int: ");
    Serial.println(Read(ADDR_CiINT), HEX);

    Serial.print("F0Ctrl: ");
    Serial.print(Read(ADDR_CiFIFOCON), HEX);
    Serial.print("  F0 Status: ");
    Serial.print(Read(ADDR_CiFIFOSTA), HEX);
    Serial.print("  F1Ctrl: ");
    Serial.print(Read(ADDR_CiFIFOCON + CiFIFO_OFFSET), HEX);
    Serial.print("  F1 Status: ");
    Serial.println(Read(ADDR_CiFIFOSTA + CiFIFO_OFFSET), HEX);
}

void MCP2517FD::Reset() {
    if (sdMutex != NULL) {
        xSemaphoreTakeRecursive(sdMutex, portMAX_DELAY);
    }
    uint8_t buf[2];
    buf[0] = CMD_RESET;
    buf[1] = CMD_RESET;
    SPI.beginTransaction(fdSPISettings);
    digitalWrite(_CS,LOW);
    SPI.writeBytes(buf, 2);
    digitalWrite(_CS,HIGH);
    SPI.endTransaction();
    if (sdMutex != NULL) {
        xSemaphoreGiveRecursive(sdMutex);
    }
}

uint32_t MCP2517FD::Read(uint16_t address) {
    if (sdMutex != NULL) {
        xSemaphoreTakeRecursive(sdMutex, portMAX_DELAY);
    }
    uint8_t out_buf[8];
    uint8_t in_buff[8];
    out_buf[0] = (CMD_READ << 4)| ( (address >> 8) & 0xF);
    out_buf[1] = address & 0xFF;
    out_buf[2] = out_buf[3] = out_buf[4] = out_buf[5] = 0;
    SPI.beginTransaction(fdSPISettings);
    digitalWrite(_CS,LOW);
    SPI.transferBytes(out_buf, in_buff, 6);
    digitalWrite(_CS,HIGH);
    SPI.endTransaction();

    uint32_t data = *((uint32_t *)(in_buff + 2));
    if (sdMutex != NULL) {
        xSemaphoreGiveRecursive(sdMutex);
    }
    return data;
}

uint8_t MCP2517FD::Read8(uint16_t address)
{
    if (sdMutex != NULL) {
        xSemaphoreTakeRecursive(sdMutex, portMAX_DELAY);
    }
    uint8_t out_buff[4];
    uint8_t in_buff[4];
    out_buff[0] = (CMD_READ << 4) | ((address >> 8) & 0xF);
    out_buff[1] = address & 0xFF;
    out_buff[2] = 0;

    SPI.beginTransaction(fdSPISettings);
    digitalWrite(_CS,LOW);
    SPI.transferBytes(out_buff, in_buff, 3);
    digitalWrite(_CS,HIGH);
    SPI.endTransaction();
    uint8_t res = in_buff[2];
    if (sdMutex != NULL) {
        xSemaphoreGiveRecursive(sdMutex);
    }
    return res;
}

uint16_t MCP2517FD::Read16(uint16_t address)
{
    if (sdMutex != NULL) {
        xSemaphoreTakeRecursive(sdMutex, portMAX_DELAY);
    }
    uint8_t out_buff[5];
    uint8_t in_buff[5];
    out_buff[0] = (CMD_READ << 4) | ((address >> 8) & 0xF);
    out_buff[1] = address & 0xFF;
    out_buff[2] = out_buff[3] = 0;

    SPI.beginTransaction(fdSPISettings);
    digitalWrite(_CS,LOW);
    SPI.transferBytes(out_buff, in_buff, 4);
    digitalWrite(_CS,HIGH);
    SPI.endTransaction();
    uint16_t res = *((uint16_t *)(in_buff + 2));
    if (sdMutex != NULL) {
        xSemaphoreGiveRecursive(sdMutex);
    }
    return res;
}

void MCP2517FD::Read(uint16_t address, uint8_t data[], uint16_t bytes) {
    if (sdMutex != NULL) {
        xSemaphoreTakeRecursive(sdMutex, portMAX_DELAY);
    }
    uint8_t out_buff[100];
    uint8_t in_buff[100];

    out_buff[0] = (CMD_READ << 4) | ((address >> 8) & 0xF);
    out_buff[1] = address & 0xFF;
    for (int i = 0; i < bytes; i++) out_buff[2 + i] = 0;

    // allows for sequential reading of registers starting at address - see data sheet
    SPI.beginTransaction(fdSPISettings);
    digitalWrite(_CS,LOW);
    SPI.transferBytes(out_buff, in_buff, bytes + 2); //read only operation
    digitalWrite(_CS,HIGH);
    SPI.endTransaction();
    memcpy(data, (in_buff + 2), bytes);
    if (sdMutex != NULL) {
        xSemaphoreGiveRecursive(sdMutex);
    }
}

uint32_t MCP2517FD::ReadFrameBuffer(uint16_t address, CAN_FRAME_FD &message) {
    if (sdMutex != NULL) {
        xSemaphoreTakeRecursive(sdMutex, portMAX_DELAY);
    }
    uint8_t out_buff[100];
    uint8_t in_buff[100];
    uint32_t *ptr_buff = (uint32_t *)(&in_buff[2]);

    memset(out_buff, 0, 100);
    out_buff[0] = (CMD_READ << 4) | ((address >> 8) & 0xF);
    out_buff[1] = address & 0xFF;

    //there is no read buffer command anymore. Need to read from RAM on the chip
    //quickly read the whole thing then process it afterward
    SPI.beginTransaction(fdSPISettings);
    digitalWrite(_CS,LOW);

    //read enough of the RAM to get an 8 byte message.
    //Then we check to see if we really need to read more.
    //This prevents having to read 64 data bytes if we were just receiving normal frames.
    SPI.transferBytes(out_buff, in_buff, 22);
    message.length = ptr_buff[1] & 0xF;
    switch (message.length)
    {
    case 9:
        message.length = 12;
        break;
    case 10:
        message.length = 16;
        break;
    case 11:
        message.length = 20;
        break;
    case 12:
        message.length = 24;
        break;
    case 13:
        message.length = 32;
        break;
    case 14:
        message.length = 48;
        break;
    case 15:
        message.length = 64;
        break;
    }
    int neededBytes = message.length - 8;
    if (neededBytes > 0) SPI.transferBytes(&out_buff[22], &in_buff[22], neededBytes);
    digitalWrite(_CS,HIGH);
    SPI.endTransaction();
  /*message in RAM is as follows:
    The first 32 bits are the message ID, either 11 or 29 bit (12 bit not handled yet), then bit 29 is RRS
    The next 32 bits have:
       first 4 bits are DLC
       Then
       IDE (extended address) (bit 4)
       RTR (Remote request) (bit 5)
       BRS (Baud rate switch for data) (bit 6)
       FDF (FD mode) (Bit 7)
       ESI (1 = tx node error passive, 0 = tx node error active) (bit 8)
       Bits 11 - 15 = Filter hit (0-31)
    The next 32 bits are all the timestamp (in microseconds for us)
    Then each additional byte is a data byte (up to 64 bytes)
  */
    message.extended = (ptr_buff[1] >> 4) & 1;
    if (message.extended) message.id = unpackExtValue(ptr_buff[0] & 0x1FFFFFFFull);
    else message.id = ptr_buff[0] & 0x7FF;
    message.fid = 0;
    message.priority = 0;
    message.fdMode = (ptr_buff[1] >> 7) & 1;
    if (message.fdMode)
        message.rrs = ptr_buff[0] >> 29 & 1;
    else
        message.rrs = ptr_buff[1] >> 5 & 1;
    message.timestamp = ptr_buff[2];
    if (!message.fdMode && message.length > 8) message.length = 8;
    //only copy the number of words we really have to.
    int copyWords = (message.length + 3) / 4;
    for (int j = 0; j < copyWords; j++) message.data.uint32[j] = ptr_buff[3 + j];
    uint32_t res = (ptr_buff[1] >> 11) & 31; //return which filter produced this message
    if (sdMutex != NULL) {
        xSemaphoreGiveRecursive(sdMutex);
    }
    return res;
}

void MCP2517FD::Write8(uint16_t address, uint8_t data) {
    if (sdMutex != NULL) {
        xSemaphoreTakeRecursive(sdMutex, portMAX_DELAY);
    }
    uint8_t buf[4];
    buf[0] = (CMD_WRITE << 4) | ((address >> 8) & 0xF);
    buf[1] = address & 0xFF;
    buf[2] = data;
    SPI.beginTransaction(fdSPISettings);
    digitalWrite(_CS,LOW);
    SPI.writeBytes(buf, 3);
    digitalWrite(_CS,HIGH);
    SPI.endTransaction();
    if (sdMutex != NULL) {
        xSemaphoreGiveRecursive(sdMutex);
    }
}

void MCP2517FD::Write16(uint16_t address, uint16_t data) {
    if (sdMutex != NULL) {
        xSemaphoreTakeRecursive(sdMutex, portMAX_DELAY);
    }
    uint8_t buf[5];
    buf[0] = (CMD_WRITE << 4) | ((address >> 8) & 0xF);
    buf[1] = address & 0xFF;
    buf[2] = data & 0xFF;
    buf[3] = (data >> 8) & 0xFF;
    SPI.beginTransaction(fdSPISettings);
    digitalWrite(_CS,LOW);
    SPI.writeBytes(buf, 4);
    digitalWrite(_CS,HIGH);
    SPI.endTransaction();
    if (sdMutex != NULL) {
        xSemaphoreGiveRecursive(sdMutex);
    }
}

void MCP2517FD::Write(uint16_t address, uint32_t data) {
    if (sdMutex != NULL) {
        xSemaphoreTakeRecursive(sdMutex, portMAX_DELAY);
    }
    uint8_t buf[7];
    buf[0] = (CMD_WRITE << 4) | ((address >> 8) & 0xF);
    buf[1] = address & 0xFF;
    buf[2] = data & 0xFF;
    buf[3] = (data >> 8) & 0xFF;
    buf[4] = (data >> 16) & 0xFF;
    buf[5] = (data >> 24) & 0xFF;
    SPI.beginTransaction(fdSPISettings);
    digitalWrite(_CS,LOW);
    SPI.writeBytes(buf, 6);
    digitalWrite(_CS,HIGH);
    SPI.endTransaction();
    if (sdMutex != NULL) {
        xSemaphoreGiveRecursive(sdMutex);
    }
}

void MCP2517FD::Write(uint16_t address, uint8_t data[], uint16_t bytes) {
    if (sdMutex != NULL) {
        xSemaphoreTakeRecursive(sdMutex, portMAX_DELAY);
    }
    // allows for sequential writing of registers starting at address - see data sheet
    uint8_t i;
    //taskDISABLE_INTERRUPTS();
    SPI.beginTransaction(fdSPISettings);
    digitalWrite(_CS,LOW);
    SPI.transfer((CMD_WRITE << 4) | ((address >> 8) & 0xF) );
    SPI.transfer(address & 0xFF);
    SPI.writeBytes(data, bytes);
    digitalWrite(_CS,HIGH);
    SPI.endTransaction();
    //taskENABLE_INTERRUPTS();
    if (sdMutex != NULL) {
        xSemaphoreGiveRecursive(sdMutex);
    }
}

void MCP2517FD::LoadFrameBuffer(uint16_t address, CAN_FRAME_FD &message)
{
    if (sdMutex != NULL) {
        xSemaphoreTakeRecursive(sdMutex, portMAX_DELAY);
    }
    uint8_t buffer[76];
    uint32_t *buffPtr;
    int dataBytes;
    /*message in RAM is as follows (same as RX but without the timestamp):
    The first 32 bits are the message ID, either 11 or 29 bit (12 bit not handled yet), then bit 29 is RRS
    The next 32 bits have:
       first 4 bits are DLC
       Then
       IDE (extended address) (bit 4)
       RTR (Remote request) (bit 5)
       BRS (Baud rate switch for data) (bit 6)
       FDF (FD mode) (Bit 7)
       ESI (1 = tx node error passive, 0 = tx node error active) (bit 8)
       SEQ (sequence number) (Bits 9-15) - Optional sequence number for your reference
    Then each additional byte is a data byte (up to 64 bytes)
    */
    buffer[0] = (CMD_WRITE << 4) | ((address >> 8) & 0xF);
    buffer[1] = address & 0xFF;
    buffPtr = (uint32_t *)&buffer[2];

    if (message.extended) buffPtr[0] = packExtValue(message.id);
    else buffPtr[0] = message.id & 0x7FF;

