oracoll/ESP32RET/ESP32RET CLEAN/lib/ESP32_MCP2517FD/src/esp32_mcp2517fd.cpp
    buffPtr[1] = (message.extended) ? (1 << 4) : 0;
    buffPtr[1] |= (message.fdMode) ? (3 << 6) : 0; //set both the BRS and FDF bits at once
    if (message.fdMode)
        buffPtr[0] |= (message.rrs) ? (1 << 29) : 0;
    else
        buffPtr[1] |= (message.rrs) ? (1 << 5) : 0;
    if (!message.fdMode && message.length > 8) message.length = 8;
    dataBytes = message.length;

    //promote requested frame length to the next allowable size
    if (message.length > 8 && message.length < 13) buffPtr[1] |= 9;
    else if (message.length > 12 && message.length < 17) buffPtr[1] |= 10;
    else if (message.length > 16 && message.length < 21) buffPtr[1] |= 11;
    else if (message.length > 20 && message.length < 25) buffPtr[1] |= 12;
    else if (message.length > 24 && message.length < 33) buffPtr[1] |= 13;
    else if (message.length > 32 && message.length < 49) buffPtr[1] |= 14;
    else if (message.length > 48 && message.length < 65) buffPtr[1] |= 15;
    else
    {
        if (message.length < 9) buffPtr[1] |= message.length;
        else buffPtr[1] |= 8;
    }

    //only copy the number of data words we really have to.
    int copyWords = (dataBytes + 3) / 4;
    for (int j = 0; j < copyWords; j++)
    {
        buffPtr[2 + j] = message.data.uint32[j];
    }

    if (debuggingMode)
    {
        Serial.print("Load TXBufr Addr ");
        Serial.print(address, HEX);
        Serial.print(" Buff0 ");
        Serial.print(buffPtr[0], HEX);
        Serial.print(" Buff1 ");
        Serial.println(buffPtr[1], HEX);
    }

    //taskDISABLE_INTERRUPTS();
    SPI.beginTransaction(fdSPISettings);
    digitalWrite(_CS,LOW);
    SPI.writeBytes((uint8_t *) &buffer[0], 10 + (copyWords * 4)); //and only write just as many bytes as we need to for this frame
    digitalWrite(_CS,HIGH);
    SPI.endTransaction();
    //taskENABLE_INTERRUPTS();
    Write8(ADDR_CiFIFOCON + 1, 3); //Set UINC and TX_Request
    if (debuggingMode)
    {
        Serial.write('_');
        uint32_t cnf = Read(ADDR_CiFIFOCON);
        Serial.printf("FIFOCON: 0x%x\n", cnf);
    }
    if (sdMutex != NULL) {
        xSemaphoreGiveRecursive(sdMutex);
    }
}

bool MCP2517FD::Interrupt() {
    return (digitalRead(_INT)==LOW);
}

bool MCP2517FD::Mode(byte mode) {
    uint32_t tempMode;
    if (debuggingMode) Serial.println("Mode");
    tempMode = Read(ADDR_CiCON);
    tempMode &= 0xF8FFFFFF;
    tempMode |= (mode << 24ul);
    Write(ADDR_CiCON, tempMode);
    delay(6); // allow for any transmissions to complete
    uint8_t data = Read8(ADDR_CiCON + 2);
    if (debuggingMode)
    {
        Serial.println(data, BIN);
        Serial.println(mode, BIN);
    }
    return ((data >> 5) == mode);
}

/*Initializes filters to either accept all frames or accept none
  By default on the MCP2517FD all filters are not enabled and probably
  that means you won't get anything unless you pass that you want
  permissive mode.
*/
void MCP2517FD::InitFilters(bool permissive) {
    uint32_t value;
    uint32_t value32;
    if (permissive)
    {
        value = 0;
        value32 = 0;
    }
    else
    {
        value = 0x7FF; //all 11 bits set
        value32 = 0x1FFFFFFF; //all 29 bits set
    }

    _setFilterSpecific(0, value, value, false);
    _setFilterSpecific(1, value32, value32, true);
}

//Places the given frame into the receive queue
void IRAM_ATTR MCP2517FD::EnqueueRX(CAN_FRAME_FD& newFrame) {
    xQueueSend(rxQueue, &newFrame, 0);
}

void IRAM_ATTR MCP2517FD::EnqueueRX(CAN_FRAME& newFrame) {
    xQueueSend(rxQueue, &newFrame, 0);
}


//Places the given frame either into a hardware FIFO (if there is space)
//or into the software side queue if there was no room
void MCP2517FD::EnqueueTX(CAN_FRAME_FD& newFrame) {
    handleTXFifo(0, newFrame);
}

void MCP2517FD::EnqueueTX(CAN_FRAME& newFrame) {
    handleTXFifo(0, newFrame);
}

bool MCP2517FD::GetRXFrame(CAN_FRAME_FD &frame) {
    if (!rxQueue) return false;
    if (xQueueReceive(rxQueue, &frame, 0) == pdTRUE) return true;
    return false;
}

bool MCP2517FD::GetRXFrame(CAN_FRAME &frame) {
    if (!rxQueue) return false;
    if (xQueueReceive(rxQueue, &frame, 0) == pdTRUE) return true;
    return false;
}

//Not truly an interrupt handler in the sense that it does NOT run in interrupt context
//but it does handle the MCP2517FD interrupt still.
void MCP2517FD::intHandler(void) {
    CAN_FRAME_FD messageFD;
    CAN_FRAME message;
    uint32_t ctrlVal;
    uint32_t status;
    uint16_t addr;
    uint32_t filtHit;

    if (!running) return;

    if (sdMutex != NULL) {
        if (xSemaphoreTakeRecursive(sdMutex, pdMS_TO_TICKS(1)) != pdTRUE) {
            return;
        }
    }

    // determine which interrupt flags have been set
    uint32_t interruptFlags = Read(ADDR_CiINT);

    //if(interruptFlags & 1)  //Transmit FIFO interrupt
    //{
      //Only FIFO0 is TX so no need to ask for which FIFO.
      //Write8(ADDR_CiFIFOCON, 0x80); //Keep FIFO as TX but disable Queue Empty Interrupt
      //handleTXFifoISR(0);
    //}
    //else //didn't get TX interrupt but check if we've got msgs in FIFO and see if we can queue them into hardware
    {
      if (uxQueueMessagesWaiting(txQueue) > 0) handleTXFifoISR(0); //if we have messages to send then try to queue them in the TX fifo
    }

    if(interruptFlags & 2)  //Receive FIFO interrupt
    {
        //no need to ask which FIFO matched, there is only one RX FIFO configured in this library
        //So, ask for frames out of the FIFO until it no longer has any
        status = Read( ADDR_CiFIFOSTA + (CiFIFO_OFFSET * 1) );
        while (status & 1) // there is at least one message waiting to be received
        {
            //Get address to read from
            addr = Read(ADDR_CiFIFOUA + (CiFIFO_OFFSET * 1));
            //Then use that address to read the frame
            filtHit = ReadFrameBuffer(addr + 0x400, messageFD); //stupidly the returned address from FIFOUA needs an offset
            Write8(ADDR_CiFIFOCON + (CiFIFO_OFFSET * 1) + 1, 1); //set UINC (it's at bit 8 in the register so we move one byte into register and write 8 bits)
            status = Read( ADDR_CiFIFOSTA + (CiFIFO_OFFSET * 1) ); //read the register again to see if there are more frames waiting
            if (inFDMode)
                handleFrameDispatch(messageFD, filtHit);
            else
            {
                fdToCan(messageFD, message);
                handleFrameDispatch(message, filtHit);
            }
        }
    }
    if (interruptFlags & (1 << 11)) //Receive Object Overflow
    {
        //once again, we know which FIFO must have overflowed - what to do about it though?
        errorFlags |= 1;
    }
    if (interruptFlags & (1 << 12)) //System error
    {
        errorFlags |= 2;
    }
    if (interruptFlags & (1 << 13)) //CANBus error
    {
        errorFlags |= 4;
    }
    if (interruptFlags & (1 << 15)) //Invalid msg interrupt
    {
        errorFlags |= 8;
    }
    if (errorFlags > 0)
    {
        //if (debuggingMode) Serial.write('?');
        uint32_t diagBits = getCIBDIAG1(); //get a detailed fault status

        if (diagBits & 0x3030000) //either NBIT0 or NBIT1 error (or DBIT0, DBIT1)
        {
            txFault = true;
            faulted = true;
            Serial.print("**");
            cachedDiag1 |= diagBits;
            needMCPReset = true; //if set true we'd auto reset the hardware when bit errors happen.
            Write(ADDR_CiBDIAG1, 0);
        }
        if (diagBits & 0x40000) //18 - NACK fault
        {
            //Just set the TXfault flag not the genera faulted flag. This might be just a lack of CAN bus
            txFault = true;
        }
        if (diagBits & 0x38380000) //19 - RX Fixed form, Bit stuff, or CRC error, either FD or not
        {
            rxFault = true;
            faulted = true;
            Serial.print("!!");
            cachedDiag1 |= diagBits;
            needMCPReset = true; //could reset when these errors happen. Maybe count errors to decide?
            Write(ADDR_CiBDIAG1, 0);
        }
        if (diagBits & 0x800000) //23 - TXBOERR - device went bus-off (and auto recovered)
        {
            //it's OK if it goes bus off and tries to recover. Don't reset as we might mess up the bus if we're insane
        }
        if (diagBits & 0x40000000) //30 - ESI of RX FD message was set
        {
            rxFault = true;
            faulted = true;
        }
        if (diagBits & 0x80000000) //31 - DLC mismatch during RX or TX
        {
            //allow a dlc mismatch and don't do anything
            //rxFault = true;
        }
    }

    //Now, acknowledge the interrupts by clearing the intf bits
    Write16(ADDR_CiINT, 0);
    if (sdMutex != NULL) {
        xSemaphoreGiveRecursive(sdMutex);
    }
}

//TX fifo is 0
void MCP2517FD::handleTXFifoISR(int fifo)
{
    uint32_t status;
    uint16_t addr;
    CAN_FRAME_FD frameFD;
    CAN_FRAME frame;
    uint8_t wroteFrames = 0;

    //if (fifo < 0) return;
    //if (fifo > 2) return;

    //taskDISABLE_INTERRUPTS();

    status = Read( ADDR_CiFIFOSTA + (CiFIFO_OFFSET * fifo) );
    //Write8(ADDR_CiFIFOSTA + (CiFIFO_OFFSET * fifo), 0); //reset all the fault bits in the FIFO (TXABT, TXLARB, TXERR)
    //Write8(ADDR_CiBDIAG0 + (CiFIFO_OFFSET * fifo) + 1, 0); //Clear TX error counter
    //Write8(ADDR_CiBDIAG1 + (CiFIFO_OFFSET * fifo) + 2, 0); //clear bits 16-23 in diag1 register
    if ((status & 0x20) == 0x20) needTXFIFOReset = true; //if the queue registered a fault then set flag to have it reset
    //While the FIFO has room and we still have frames to send
    while ( (status & 1) && (uxQueueMessagesWaiting(txQueue) > 0) ) //while fifo is not full and we have messages waiting
    {
        if (debuggingMode)
        {
            Serial.write('~');
        }
        //get address to write to
        addr = Read( ADDR_CiFIFOUA + (CiFIFO_OFFSET * fifo) );
        if (inFDMode)
        {
            //if (debuggingMode) Serial.write('F');
            if (xQueueReceive(txQueue, &frameFD, 0) != pdTRUE) return; //abort if we can't load a frame from the queue!
        }
        else
        {
            //if (debuggingMode) Serial.write('S');
            if (xQueueReceive(txQueue, &frame, 0) != pdTRUE) return;
            //hardware loading below always uses the same buffer save whether CAN or CANFD
            if (!canToFD(frame, frameFD)) return;
        }
        LoadFrameBuffer( addr + 0x400, frameFD );
        wroteFrames = 1;
        status = Read(ADDR_CiFIFOSTA + (CiFIFO_OFFSET * fifo));
        //if (debuggingMode) Serial.printf("After write Status: %x\n", status);
    }
    if (wroteFrames != 0)
    {
        //Write8(ADDR_CiFIFOCON + (CiFIFO_OFFSET * fifo), 0x84); //Keep as TX queue and enable interrupt for queue empty
        if (debuggingMode) Serial.write('\"');
    }
  //taskENABLE_INTERRUPTS();
}

