oracoll/ESP32RET/ESP32RET CLEAN/lib/ESP32_MCP2517FD/src/esp32_mcp2517fd.cpp
/*
This routine used to try to load a frame into hardware if possible. But, testing has shown that
the ESP32 doesn't really take kindly to multiple pathways trying to use SPI at once. The SPI
library just plain dies if you do that. So, all SPI access is through the interrupt handler now
To make this work this routine just pretends an interrupt came in and so the interrupt handler
sees our frame and tries to send it.
*/
void MCP2517FD::handleTXFifo(int fifo, CAN_FRAME_FD &newFrame)
{
    uint32_t status;
    uint16_t addr;
    //BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    if (fifo < 0) return;
    if (fifo > 2) return;

    //status = Read( ADDR_CiFIFOSTA + (CiFIFO_OFFSET * fifo) );
    //if (status & 1) //FIFO has room for this message - immediately send it to hardware
    //{
    //  addr = Read( ADDR_CiFIFOUA + (CiFIFO_OFFSET * fifo) );
    //  LoadFrameBuffer( addr + 0x400, newFrame );
    //  Write8(ADDR_CiFIFOCON + (CiFIFO_OFFSET * fifo) + 1, 3); //Set UINC and TX_Request
    //}
    //else //no room on hardware. Locally buffer in software
    //{
    //try to queue, do not wait if we can't. If we can then pretend an interrupt happened.
    if (!txQueue) return;
    if (xQueueSend(txQueue, &newFrame, 0) == pdPASS)
    {
        if (debuggingMode) Serial.write('+');
        //xHigherPriorityTaskWoken = xTaskNotifyGive(intTaskFD); //send notice to the handler task that it can do the SPI transaction now
    }
    else //full queue, if debugging we'll dump the hardware state.
    {
        //Write8(ADDR_CiFIFOCON + (CiFIFO_OFFSET * fifo) + 1, 2); //Set TX_Request to make sure the FIFO is really trying to send
        if (debuggingMode)
        {
            Serial.write('<');
            Serial.println();
            printDebug();
        }
    }
  //}
}

void MCP2517FD::handleTXFifo(int fifo, CAN_FRAME &newFrame)
{
    uint32_t status;
    uint16_t addr;
    CAN_FRAME_FD fd;
    BaseType_t ret;

    if (fifo < 0) return;
    if (fifo > 2) return;

    if (!txQueue) return;

    if (inFDMode) //if we're in FD mode the queue takes CAN-FD frames
    {
        canToFD(newFrame, fd);
        ret = xQueueSend(txQueue, &fd, 0);
    }
    else
    {
        ret = xQueueSend(txQueue, &newFrame, 0);
    }
    if (ret == pdPASS)
    {
        if (debuggingMode) Serial.write('+');
    }
    else //full queue, if debugging we'll dump the hardware state.
    {
        if (debuggingMode)
        {
            Serial.write('<');
            Serial.println();
            printDebug();
        }
    }
}


/*The idea here is to use the fid member (which is not normally used) as a signal to
  downstream of the type of callback that needs to be done.
  The lowest 8 bits are used to pass the filter that matched (or FF if general callback)
  If bit 31 is set then it's an object callback and the upper byte (minus that top one) are the listener position
*/
void MCP2517FD::handleFrameDispatch(CAN_FRAME_FD &frame, int filterHit)
{
    CANListener *thisListener;

    //First, try to send a callback. If no callback registered then buffer the frame.
    if (cbCANFrame[filterHit])
    {
        frame.fid = filterHit;
        xQueueSend(callbackQueueMCP, &frame, 0);
        return;
    }
    else if (cbGeneral)
    {
        frame.fid = 0xFF;
        xQueueSend(callbackQueueMCP, &frame, 0);
        return;
    }
    else
    {
        for (int listenerPos = 0; listenerPos < SIZE_LISTENERS; listenerPos++)
        {
            thisListener = listener[listenerPos];
            if (thisListener != NULL)
            {
                if (thisListener->isCallbackActive(filterHit))
                {
                    frame.fid = 0x80000000ul + (listenerPos << 24ul) + filterHit;
                    xQueueSend(callbackQueueMCP, &frame, 0);
                    return;
                }
                else if (thisListener->isCallbackActive(numFilters)) //global catch-all
                {
                    frame.fid = 0x80000000ul + (listenerPos << 24ul) + 0xFF;
                    xQueueSend(callbackQueueMCP, &frame, 0);
                    return;
                }
            }
        }
    }
    //if none of the callback types caught this frame then queue it in the buffer
    xQueueSend(rxQueue, &frame, 0);
}

void MCP2517FD::handleFrameDispatch(CAN_FRAME &frame, int filterHit)
{
    CANListener *thisListener;

    //First, try to send a callback. If no callback registered then buffer the frame.
    if (cbCANFrame[filterHit])
    {
        frame.fid = filterHit;
        xQueueSend(callbackQueueMCP, &frame, 0);
        return;
    }
    else if (cbGeneral)
    {
        frame.fid = 0xFF;
        xQueueSend(callbackQueueMCP, &frame, 0);
        return;
    }
    else
    {
        for (int listenerPos = 0; listenerPos < SIZE_LISTENERS; listenerPos++)
        {
            thisListener = listener[listenerPos];
            if (thisListener != NULL)
            {
                if (thisListener->isCallbackActive(filterHit))
                {
                    frame.fid = 0x80000000ul + (listenerPos << 24ul) + filterHit;
                    xQueueSend(callbackQueueMCP, &frame, 0);
                    return;
                }
                else if (thisListener->isCallbackActive(numFilters)) //global catch-all
                {
                    frame.fid = 0x80000000ul + (listenerPos << 24ul) + 0xFF;
                    xQueueSend(callbackQueueMCP, &frame, 0);
                    return;
                }
            }
        }
    }
    //if none of the callback types caught this frame then queue it in the buffer
    xQueueSend(rxQueue, &frame, 0);
}
